# Ситаксис цикла while
# while expression: 
#     body

# expression - логическое выражение (если верно - тело цикла будет выполнено, если ложно - выход из цикла)
# body - блок кода (тело цикла), который выполняется в случае верного логического выражения

# переменная цикла - параметр, который так или иначе задействован при построении логического выражения, и может изменять свое значение в теле цикла
# итерация - разовое выполенние тела цикла
# итерирование - процесс работы цикла (процесс выполнения набора итераций)

# Простейший пример цикла while

i = 0
while i < 10:
    print('Current value:', i)
    i += 1 # i = i + 1 
    # Возможные операции сокращенного инкремента/декремента
    # i -= 1 # i = i - 1  
    # i *= 2 # i = i * 2
    # i /= 2 # i = i / 2
    # i **= 2 # i = i ** 2
    # i %= 2 # i = i % 2
    # i //= 2 # i = i // 2

print("Done!")