# Синонимические приведение логического выражения

# Синонимическое приведение целого числа:
#    * если это 0 -> False
#    * если это не 0 -> True

# Синонимическое приведение вещественного числа:
#      * если это 0.0 -> False
#      * если это не 0.0 -> True

# Синонимическое приведение строки:
#     * если это "" -> False
#     * если это не "" -> True

# Синонимическое приведение None:
#    * если это None -> False
#    * если это not None -> True

if 'a':
    print("Yes")
else:
    print("No")

while 10:
    break