# На вход программе поступает n - информация про друзей
# Про каждого друга известно "Имя Месяц" (где имя - имя друга, месяц - это месяц когда он родился)
# Задача - сохранить друзей удобным для обработки образом

# С прединициализированным словарем
birthdays = {
    "янв" : [],
    "фев" : [],
    "мар" : [],
    "апр" : [],
    "май" : [],
    "июн" : [],
    "июл" : [],
    "авг" : [],
    "сен" : [],
    "окт" : [],
    "ноя" : [],
    "дек" : [],
}

n = int(input().strip()) # Количество друзей для добавления в книгу
for _ in range(n):
    info = input().strip().split() # "Вася май" -> ["Вася", "май"]
    name = info[0]
    month = info[1]

    birthdays[month].append(name)

m = int(input().strip()) # Количество запрос к книге
for _ in range(m):
    new_month = input().strip()
    print(" ".join(sorted(birthdays[new_month])))

print("Total book:", birthdays)