"""
example_a:
    Пример модуля с:
    * явной функцией (1 шт)
    * переменной (1 шт)
    * каким-то куском кода, который использует функцию и переменную
"""


def add(x_arg:int, y_arg:int):
    """
    Сложение вида x^3 + y ^4
    """
    return x_arg ** 3 + y_arg ** 4


MAX_ATTEMPTS = 10

# 2. Как сделать так, чтобы
# данный фрагмент кода выполнялся только
# при прямом запуске данного модуля? А при импортировании
# этого модуля - код ниже игнорировался?
def run():
    """
    entry point
    """
    for i in range(MAX_ATTEMPTS):
        print("Res:", add(i, i + MAX_ATTEMPTS))
        if i > 3 :
            break

if __name__ == '__main__':
    run()